---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinSpanlengthTopAlt
source: html/cb64ee49-68ff-87a3-8a91-85f0c39a49ed.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinSpanlengthTopAlt Property

"Top (Alternating Bar)"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinSpanlengthTopAlt { get; }
```